Revit 2024 API
PointCloudType.ColorEncoding Property
 The color encoding used by points extracted from instances of this point cloud.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public PointCloudColorEncoding ColorEncoding { get; }
Visual Basic
Public ReadOnly Property ColorEncoding As PointCloudColorEncoding
	Get
Visual C++
public:
property PointCloudColorEncoding ColorEncoding {
	PointCloudColorEncoding get ();
}
See Also
PointCloudType Class
Autodesk.Revit.DB Namespace